windows-sublime-python3-strange-glyphs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-07-29 Sun 14:47 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Windows上Sublime3跑Python3程序时，乱码怎么弄？</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Windows上Sublime3跑Python3程序时，乱码怎么弄？</h1>
<p>
以用Anaconda3安装的Python3为例。实际上蛮简单，比如我的Anaconda3安装在<code>c:/Users/md11235/Anaconda3/</code> ，那么在Sublime3的菜单里，依次选择“工具 -&gt; 编译系统 -&gt; 新编译系统”，此时你会看到：</p>

<div class="org-src-container">
<pre class="src src-python">{
    <span style="color: #ffa500;">"shell_cmd"</span>: <span style="color: #ffa500;">"make"</span>
}  
</pre>
</div>

<p>
用下面的代码替换上面的所有代码：</p>

<div class="org-src-container">
<pre class="src src-python">{  
    <span style="color: #ffa500;">"cmd"</span>: [<span style="color: #ffa500;">"c:/Users/md11235/Anaconda3/python.exe"</span>,<span style="color: #ffa500;">"-u"</span>,<span style="color: #ffa500;">"$file"</span>],  
    <span style="color: #ffa500;">"file_regex"</span>: <span style="color: #ffa500;">"^[ ]*File \"(...*?)\", line ([0-9]*)"</span>,  
    <span style="color: #ffa500;">"selector"</span>: <span style="color: #ffa500;">"source.python"</span>,  
    <span style="color: #ffa500;">"encoding"</span>: <span style="color: #ffa500;">"cp936"</span> 
}
</pre>
</div>

<p>
注意1：把 <code>"c:/Users/md11235/Anaconda3/python.exe"</code> 替换成你自己的Anaconda3的安装目录下的python.exe的路径。</p>

<p>
注意2：上面的"cmd" 后面的方括号里，用的是Anaconda3里的python.exe的绝对路径，而且路径分隔符需要写成Unix下的 <code>"/"</code> 而不是Windows下的 <code>"\"</code> 。</p>

<p>
然后保存当前配置文件为: "MyPython3.sublime-build", 然后在工具-&gt;编译系统-&gt;选择 "MyPython3"
</p>

<p>
接下来用 <code>ctrl-b</code> 试试原本乱码的python代码，看看输出是什么。</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>